# taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# fonts 
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# neovim
brew "bob" 

# python 
brew "pyenv"
brew "poetry"
brew "sphinx-doc"

# terminal
cask "iterm2"
brew "zsh"

# pimp my terminal
brew "neofetch"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "codewhisperer"

brew "tmux"
brew "htop"
brew "fd"
brew "git"
brew "curl"
brew "wget"
brew "cmake"

# version control
brew "flyway"
brew "gh"
brew "git-gui"

# desktop apps
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "scroll-reverser"
cask "dbeaver-community"

# others
brew "node"
