brew "age" # Simple, modern, secure file encryption
brew "ansible" # Automate deployment, configuration, and upgrading
brew "autossh" # Automatically restart SSH sessions and tunnels
brew "bob" # Version manager for neovim
brew "chezmoi" # Manage your dotfiles across multiple diverse machines, securely
brew "cloc" # Statistics utility to count lines of code
brew "eza" # Modern, maintained replacement for ls
brew "fish" # User-friendly command-line shell for UNIX-like operating systems
brew "fisher" # Plugin manager for the Fish shell
brew "git" # Distributed revision control system
brew "lazygit" # Simple terminal UI for git commands
brew "make" # Utility for directing compilation
brew "mutagen-io/mutagen/mutagen" # Fast file synchronization and network forwarding for remote development
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rustup" # Rust toolchain installer
brew "starship" # Cross-shell prompt for astronauts
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "uv" # Extremely fast Python package installer and resolver, written in Rust
brew "viddy" # Like `watch`, but better
brew "wget" # Internet file retriever
brew "zstd" # Zstandard is a real-time compression algorithm
cask "chatgpt" # OpenAI's official ChatGPT desktop app
cask "cursor" # Write, edit, and chat about your code with AI
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "google-drive" # Client for the Google Drive storage service
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "tailscale-app" # Mesh VPN based on WireGuard
cask "whatsapp" # Native desktop client for WhatsApp
cask "zoom" # Video communication and virtual meeting platform
